lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
xiao_nrf54l15.menu.clean_serial.disabled=GPIO on USB bridge pads (Serial disabled)
xiao_nrf54l15.menu.clean_serial.disabled.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_DISABLED

xiao_nrf54l15.menu.clean_upload.auto=nRF OCD Native (Default)
xiao_nrf54l15.menu.clean_upload.auto.upload.tool=nrf54ocd
xiao_nrf54l15.menu.clean_upload.auto.upload.tool.serial=nrf54ocd
xiao_nrf54l15.menu.clean_upload.auto.upload.runner=nrf_ocd
xiao_nrf54l15.menu.clean_upload.auto.upload.use_1200bps_touch=false
xiao_nrf54l15.menu.clean_upload.auto.upload.wait_for_upload_port=false
xiao_nrf54l15.menu.clean_upload.auto.upload.pyocd_safe=auto

xiao_nrf54l15.menu.clean_upload.pyocd=pyOCD Recovery (CMSIS-DAP)
xiao_nrf54l15.menu.clean_upload.pyocd.upload.tool=nrf54upload
xiao_nrf54l15.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
xiao_nrf54l15.menu.clean_upload.pyocd.upload.runner=pyocd
xiao_nrf54l15.menu.clean_upload.pyocd.upload.use_1200bps_touch=false
xiao_nrf54l15.menu.clean_upload.pyocd.upload.wait_for_upload_port=false
xiao_nrf54l15.menu.clean_upload.pyocd.upload.pyocd_safe=auto

xiao_nrf54l15.menu.clean_upload.jlink=J-Link via pyOCD (Experimental)
xiao_nrf54l15.menu.clean_upload.jlink.upload.tool=nrf54upload
xiao_nrf54l15.menu.clean_upload.jlink.upload.tool.default=nrf54upload
xiao_nrf54l15.menu.clean_upload.jlink.upload.tool.serial=nrf54upload
xiao_nrf54l15.menu.clean_upload.jlink.upload.runner=pyocd
xiao_nrf54l15.menu.clean_upload.jlink.upload.protocol=default
xiao_nrf54l15.menu.clean_upload.jlink.upload.probe_type=jlink
xiao_nrf54l15.menu.clean_upload.jlink.upload.use_1200bps_touch=false
xiao_nrf54l15.menu.clean_upload.jlink.upload.wait_for_upload_port=false
xiao_nrf54l15.menu.clean_upload.jlink.upload.pyocd_safe=false

xiao_nrf54l15.menu.clean_upload.nrf_ocd=nRF OCD (Native)
xiao_nrf54l15.menu.clean_upload.nrf_ocd.upload.tool=nrf54ocd
xiao_nrf54l15.menu.clean_upload.nrf_ocd.upload.tool.serial=nrf54ocd
xiao_nrf54l15.menu.clean_upload.nrf_ocd.upload.runner=nrf_ocd
xiao_nrf54l15.menu.clean_upload.nrf_ocd.upload.use_1200bps_touch=false
xiao_nrf54l15.menu.clean_upload.nrf_ocd.upload.wait_for_upload_port=false

xiao_nrf54l15.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.runner=pyocd
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.wait_for_upload_port=false
xiao_nrf54l15.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

xiao_nrf54l15.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
xiao_nrf54l15.menu.clean_upload.uf2.upload.tool=nrf54upload
xiao_nrf54l15.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
xiao_nrf54l15.menu.clean_upload.uf2.upload.protocol=uf2
xiao_nrf54l15.menu.clean_upload.uf2.upload.runner=uf2
xiao_nrf54l15.menu.clean_upload.uf2.upload.use_1200bps_touch=false
xiao_nrf54l15.menu.clean_upload.uf2.upload.wait_for_upload_port=false

# ─── XIAO nRF54LM20A ────────────────────────────────────────────
xiao_nrf54lm20b.name=XIAO nRF54LM20A

xiao_nrf54lm20b.vid.0=0x2886
xiao_nrf54lm20b.pid.0=0x0068
xiao_nrf54lm20b.upload_port.0.vid=0x2886
xiao_nrf54lm20b.upload_port.0.pid=0x0068

xiao_nrf54lm20b.upload.tool=nrf54ocd
xiao_nrf54lm20b.upload.tool.serial=nrf54ocd
xiao_nrf54lm20b.upload.protocol=cmsis-dap
xiao_nrf54lm20b.upload.maximum_size=2072576
xiao_nrf54lm20b.upload.maximum_data_size=523584
xiao_nrf54lm20b.upload.wait_for_upload_port=false
xiao_nrf54lm20b.upload.use_1200bps_touch=false
xiao_nrf54lm20b.upload.disable_flushing=true
xiao_nrf54lm20b.upload.runner=nrf_ocd
xiao_nrf54lm20b.upload.target=nrf54lm20a
xiao_nrf54lm20b.upload.uid=
xiao_nrf54lm20b.upload.pyocd_safe=auto
xiao_nrf54lm20b.upload.probe_type=cmsisdap
xiao_nrf54lm20b.upload.uf2_drive=auto
xiao_nrf54lm20b.upload.uf2_labels=UF2BOOT,XIAO-NRF54L15,XIAO-NRF54,XIAO-NRF54LM20A,XIAO-NRF54LM20B,NRF54LM20A,NRF54LM20B,XIAO-SENSE,NRF54L15,NRF54BOOT,DAPLINK
xiao_nrf54lm20b.upload.uf2_timeout=12
xiao_nrf54lm20b.upload.openocd_script={runtime.platform.path}/tools/openocd/nrf54l15.cfg
xiao_nrf54lm20b.upload.openocd_speed=4000
xiao_nrf54lm20b.upload.openocd_bin={runtime.tools.openocd-0.11.0-arduino2.path}/bin/openocd

xiao_nrf54lm20b.serial.disableDTR=false
xiao_nrf54lm20b.serial.disableRTS=false

xiao_nrf54lm20b.build.mcu=cortex-m33
xiao_nrf54lm20b.build.f_cpu=64000000L
xiao_nrf54lm20b.build.board=XIAO_NRF54LM20A_CLEAN
xiao_nrf54lm20b.build.core=nrf54lm20b
xiao_nrf54lm20b.build.variant=xiao_nrf54lm20b
xiao_nrf54lm20b.build.ldscript=nrf54lm20b_linker_script.ld
xiao_nrf54lm20b.build.nordic_sdc_arch=nrf54lm
xiao_nrf54lm20b.build.uf2_family=0xADA54B20
xiao_nrf54lm20b.build.uf2_base_address=0x00000000
xiao_nrf54lm20b.build.cpu_flags=-DARDUINO_NRF54_CPU_64M
xiao_nrf54lm20b.build.power_flags=-DNRF54L15_CLEAN_POWER_LOW
xiao_nrf54lm20b.build.boot_flags=
xiao_nrf54lm20b.build.auto_gate_flags=
xiao_nrf54lm20b.build.security_flags=-DNRF_APPLICATION
xiao_nrf54lm20b.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1
xiao_nrf54lm20b.build.ble_tx_flags=
xiao_nrf54lm20b.build.ble_timing_flags=
xiao_nrf54lm20b.build.ble_trace_flags=
xiao_nrf54lm20b.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=0
xiao_nrf54lm20b.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=0 -DNRF54L15_CLEAN_ZIGBEE_DISABLED
xiao_nrf54lm20b.build.zigbee_channel_flags=
xiao_nrf54lm20b.build.zigbee_pan_flags=
xiao_nrf54lm20b.build.antenna_flags=
xiao_nrf54lm20b.build.serial_flags=

xiao_nrf54lm20b.menu.cpu_freq.64m=64 MHz (Default)
xiao_nrf54lm20b.menu.cpu_freq.64m.build.f_cpu=64000000L
xiao_nrf54lm20b.menu.cpu_freq.64m.build.cpu_flags=-DARDUINO_NRF54_CPU_64M
xiao_nrf54lm20b.menu.cpu_freq.128m=128 MHz
xiao_nrf54lm20b.menu.cpu_freq.128m.build.f_cpu=128000000L
xiao_nrf54lm20b.menu.cpu_freq.128m.build.cpu_flags=-DARDUINO_NRF54_CPU_128M

xiao_nrf54lm20b.build.extra_flags=-DARDUINO_NRF54LM20A -DNRF54LM20A_XXAA -DNRF54LM20_FAMILY {build.cpu_flags} {build.power_flags} {build.boot_flags} {build.auto_gate_flags} {build.security_flags} {build.ble_flags} {build.ble_tx_flags} {build.ble_timing_flags} {build.ble_trace_flags} {build.vpr_flags} {build.zigbee_flags} {build.zigbee_channel_flags} {build.zigbee_pan_flags} {build.thread_flags} {build.thread_seam_flags} {build.thread_crypto_flags} {build.matter_flags} {build.matter_seam_flags} {build.antenna_flags} {build.serial_flags}

