lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
xiao_nrf54lm20b.menu.clean_ble.on=Enabled (Default)
xiao_nrf54lm20b.menu.clean_ble.on.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1

xiao_nrf54lm20b.menu.clean_ble.off=Disabled
xiao_nrf54lm20b.menu.clean_ble.off.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=0 -DNRF54L15_CLEAN_BLE_DISABLED

xiao_nrf54lm20b.menu.clean_ble_trace.off=Disabled (Default)
xiao_nrf54lm20b.menu.clean_ble_trace.off.build.ble_trace_flags=

xiao_nrf54lm20b.menu.clean_ble_trace.on=Enabled
xiao_nrf54lm20b.menu.clean_ble_trace.on.build.ble_trace_flags=-DNRF54L15_CLEAN_BLE_TRACE=1

xiao_nrf54lm20b.menu.clean_zigbee.off=Disabled (Default)
xiao_nrf54lm20b.menu.clean_zigbee.off.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=0 -DNRF54L15_CLEAN_ZIGBEE_DISABLED

xiao_nrf54lm20b.menu.clean_zigbee.on=Enabled (Experimental)
xiao_nrf54lm20b.menu.clean_zigbee.on.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=1

xiao_nrf54lm20b.menu.clean_thread.off=Disabled (Default)
xiao_nrf54lm20b.menu.clean_thread.off.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=0 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
xiao_nrf54lm20b.menu.clean_thread.off.build.thread_seam_flags=
xiao_nrf54lm20b.menu.clean_thread.off.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

xiao_nrf54lm20b.menu.clean_thread.stage=Experimental Stage Core (Leader/Child/Router + UDP)
xiao_nrf54lm20b.menu.clean_thread.stage.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=1 -DNRF54L15_CLEAN_OPENTHREAD_MESHCOP_ENABLE=1 -DNRF54L15_CLEAN_OPENTHREAD_SRP_CLIENT_ENABLE=1 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
xiao_nrf54lm20b.menu.clean_thread.stage.build.thread_seam_flags=-DOPENTHREAD_CONFIG_CORE_USER_CONFIG_HEADER_ENABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/third_party/mbedtls/repo/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/third_party/mbedtls/repo/library -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/third_party/mbedtls
xiao_nrf54lm20b.menu.clean_thread.stage.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

xiao_nrf54lm20b.menu.clean_matter.off=Disabled (Default)
xiao_nrf54lm20b.menu.clean_matter.off.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=0 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
xiao_nrf54lm20b.menu.clean_matter.off.build.matter_seam_flags=

xiao_nrf54lm20b.menu.clean_matter.stage=Experimental Compile Target (On-Network On/Off Light)
xiao_nrf54lm20b.menu.clean_matter.stage.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=1 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
xiao_nrf54lm20b.menu.clean_matter.stage.build.matter_seam_flags=-DNRF54L15_CLEAN_MATTER_HEADER_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_SUPPORT_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_ERROR_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_KEY_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_TIME_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_HEX_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_THREAD_DATASET_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_DATA_MODEL_SEED_AVAILABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/matter_core_stage -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/config/arduino -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/lib/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/lib/support -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/system -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/inet -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/crypto -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/protocols -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/transport -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/messaging -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/platform/arduino

xiao_nrf54lm20b.menu.clean_upload.auto=nRF OCD Native (Default)
xiao_nrf54lm20b.menu.clean_upload.auto.upload.tool=nrf54ocd
xiao_nrf54lm20b.menu.clean_upload.auto.upload.tool.serial=nrf54ocd
xiao_nrf54lm20b.menu.clean_upload.auto.upload.runner=nrf_ocd
xiao_nrf54lm20b.menu.clean_upload.auto.upload.use_1200bps_touch=false
xiao_nrf54lm20b.menu.clean_upload.auto.upload.wait_for_upload_port=false
xiao_nrf54lm20b.menu.clean_upload.auto.upload.pyocd_safe=auto
xiao_nrf54lm20b.menu.clean_upload.nrf_ocd=nRF OCD (Native)
xiao_nrf54lm20b.menu.clean_upload.nrf_ocd.upload.tool=nrf54ocd
xiao_nrf54lm20b.menu.clean_upload.nrf_ocd.upload.tool.serial=nrf54ocd
xiao_nrf54lm20b.menu.clean_upload.nrf_ocd.upload.runner=nrf_ocd
xiao_nrf54lm20b.menu.clean_upload.nrf_ocd.upload.use_1200bps_touch=false
xiao_nrf54lm20b.menu.clean_upload.nrf_ocd.upload.wait_for_upload_port=false

xiao_nrf54lm20b.menu.clean_upload.pyocd=pyOCD Recovery (CMSIS-DAP)
xiao_nrf54lm20b.menu.clean_upload.pyocd.upload.tool=nrf54upload
xiao_nrf54lm20b.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
xiao_nrf54lm20b.menu.clean_upload.pyocd.upload.runner=pyocd
xiao_nrf54lm20b.menu.clean_upload.pyocd.upload.use_1200bps_touch=false
xiao_nrf54lm20b.menu.clean_upload.pyocd.upload.wait_for_upload_port=false
xiao_nrf54lm20b.menu.clean_upload.pyocd.upload.pyocd_safe=auto

xiao_nrf54lm20b.menu.clean_upload.jlink=J-Link via pyOCD (Experimental)
xiao_nrf54lm20b.menu.clean_upload.jlink.upload.tool=nrf54upload
xiao_nrf54lm20b.menu.clean_upload.jlink.upload.tool.default=nrf54upload
xiao_nrf54lm20b.menu.clean_upload.jlink.upload.tool.serial=nrf54upload
xiao_nrf54lm20b.menu.clean_upload.jlink.upload.runner=pyocd
xiao_nrf54lm20b.menu.clean_upload.jlink.upload.protocol=default
xiao_nrf54lm20b.menu.clean_upload.jlink.upload.probe_type=jlink
xiao_nrf54lm20b.menu.clean_upload.jlink.upload.use_1200bps_touch=false
xiao_nrf54lm20b.menu.clean_upload.jlink.upload.wait_for_upload_port=false
xiao_nrf54lm20b.menu.clean_upload.jlink.upload.pyocd_safe=false

