lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
holyiot_25007_nrf54l15.menu.clean_matter.off=Disabled (Default)
holyiot_25007_nrf54l15.menu.clean_matter.off.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=0 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
holyiot_25007_nrf54l15.menu.clean_matter.off.build.matter_seam_flags=

holyiot_25007_nrf54l15.menu.clean_matter.stage=Experimental Compile Target (On-Network On/Off Light)
holyiot_25007_nrf54l15.menu.clean_matter.stage.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=1 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
holyiot_25007_nrf54l15.menu.clean_matter.stage.build.matter_seam_flags=-DNRF54L15_CLEAN_MATTER_HEADER_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_SUPPORT_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_ERROR_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_KEY_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_TIME_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_HEX_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_THREAD_DATASET_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_DATA_MODEL_SEED_AVAILABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/matter_core_stage -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/config/arduino -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/lib/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/lib/support -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/system -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/inet -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/crypto -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/protocols -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/transport -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/messaging -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/platform/arduino

holyiot_25007_nrf54l15.menu.clean_upload.auto=nRF OCD Native (Default)
holyiot_25007_nrf54l15.menu.clean_upload.auto.upload.tool=nrf54ocd
holyiot_25007_nrf54l15.menu.clean_upload.auto.upload.tool.serial=nrf54ocd
holyiot_25007_nrf54l15.menu.clean_upload.auto.upload.runner=nrf_ocd
holyiot_25007_nrf54l15.menu.clean_upload.auto.upload.use_1200bps_touch=false
holyiot_25007_nrf54l15.menu.clean_upload.auto.upload.wait_for_upload_port=false

holyiot_25007_nrf54l15.menu.clean_upload.pyocd=pyOCD Recovery (CMSIS-DAP)
holyiot_25007_nrf54l15.menu.clean_upload.pyocd.upload.tool=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.pyocd.upload.runner=pyocd
holyiot_25007_nrf54l15.menu.clean_upload.pyocd.upload.use_1200bps_touch=false

holyiot_25007_nrf54l15.menu.clean_upload.jlink=J-Link via pyOCD (Experimental)
holyiot_25007_nrf54l15.menu.clean_upload.jlink.upload.tool=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.jlink.upload.tool.default=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.jlink.upload.tool.serial=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.jlink.upload.runner=pyocd
holyiot_25007_nrf54l15.menu.clean_upload.jlink.upload.protocol=default
holyiot_25007_nrf54l15.menu.clean_upload.jlink.upload.probe_type=jlink
holyiot_25007_nrf54l15.menu.clean_upload.jlink.upload.use_1200bps_touch=false
holyiot_25007_nrf54l15.menu.clean_upload.jlink.upload.wait_for_upload_port=false
holyiot_25007_nrf54l15.menu.clean_upload.jlink.upload.pyocd_safe=false

holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd=nRF OCD (Native Fallback)
holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd.upload.tool=nrf54ocd
holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd.upload.tool.serial=nrf54ocd
holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd.upload.runner=nrf_ocd
holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd.upload.use_1200bps_touch=false
holyiot_25007_nrf54l15.menu.clean_upload.nrf_ocd.upload.wait_for_upload_port=false

holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm.upload.runner=pyocd
holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
holyiot_25007_nrf54l15.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

holyiot_25007_nrf54l15.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.tool=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.protocol=uf2
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.runner=uf2
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.use_1200bps_touch=false
holyiot_25007_nrf54l15.menu.clean_upload.uf2.upload.wait_for_upload_port=false

holyiot_25008_nrf54l15.name=HOLYIOT-25008 nRF54L15 Module

holyiot_25008_nrf54l15.upload.tool=nrf54ocd
holyiot_25008_nrf54l15.upload.tool.serial=nrf54ocd
holyiot_25008_nrf54l15.upload.protocol=cmsis-dap
holyiot_25008_nrf54l15.upload.maximum_size=1548288
holyiot_25008_nrf54l15.upload.maximum_data_size=155648
holyiot_25008_nrf54l15.upload.wait_for_upload_port=false
holyiot_25008_nrf54l15.upload.use_1200bps_touch=false
holyiot_25008_nrf54l15.upload.disable_flushing=true
holyiot_25008_nrf54l15.upload.runner=nrf_ocd
holyiot_25008_nrf54l15.upload.target=nrf54l
holyiot_25008_nrf54l15.upload.uid=
holyiot_25008_nrf54l15.upload.pyocd_safe=auto
holyiot_25008_nrf54l15.upload.probe_type=cmsisdap
holyiot_25008_nrf54l15.upload.uf2_drive=auto
holyiot_25008_nrf54l15.upload.uf2_labels=UF2BOOT,XIAO-NRF54L15,XIAO-NRF54,XIAO-NRF54LM20A,XIAO-NRF54LM20B,NRF54LM20A,NRF54LM20B,XIAO-SENSE,NRF54L15,NRF54BOOT,DAPLINK
holyiot_25008_nrf54l15.upload.uf2_timeout=12
holyiot_25008_nrf54l15.upload.openocd_script={runtime.platform.path}/tools/openocd/nrf54l15.cfg
holyiot_25008_nrf54l15.upload.openocd_speed=4000
holyiot_25008_nrf54l15.upload.openocd_bin={runtime.tools.openocd-0.11.0-arduino2.path}/bin/openocd

