lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
holyiot_25008_nrf54l15.menu.clean_serial.header=Header UART on D0/D1 (Default)
holyiot_25008_nrf54l15.menu.clean_serial.header.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER

holyiot_25008_nrf54l15.menu.clean_serial.disabled=GPIO on D0/D1 (Serial disabled)
holyiot_25008_nrf54l15.menu.clean_serial.disabled.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_DISABLED

holyiot_25008_nrf54l15.menu.clean_upload.auto=nRF OCD Native (Default)
holyiot_25008_nrf54l15.menu.clean_upload.auto.upload.tool=nrf54ocd
holyiot_25008_nrf54l15.menu.clean_upload.auto.upload.tool.serial=nrf54ocd
holyiot_25008_nrf54l15.menu.clean_upload.auto.upload.runner=nrf_ocd
holyiot_25008_nrf54l15.menu.clean_upload.auto.upload.use_1200bps_touch=false
holyiot_25008_nrf54l15.menu.clean_upload.auto.upload.wait_for_upload_port=false

holyiot_25008_nrf54l15.menu.clean_upload.pyocd=pyOCD Recovery (CMSIS-DAP)
holyiot_25008_nrf54l15.menu.clean_upload.pyocd.upload.tool=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.pyocd.upload.runner=pyocd
holyiot_25008_nrf54l15.menu.clean_upload.pyocd.upload.use_1200bps_touch=false

holyiot_25008_nrf54l15.menu.clean_upload.jlink=J-Link via pyOCD (Experimental)
holyiot_25008_nrf54l15.menu.clean_upload.jlink.upload.tool=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.jlink.upload.tool.default=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.jlink.upload.tool.serial=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.jlink.upload.runner=pyocd
holyiot_25008_nrf54l15.menu.clean_upload.jlink.upload.protocol=default
holyiot_25008_nrf54l15.menu.clean_upload.jlink.upload.probe_type=jlink
holyiot_25008_nrf54l15.menu.clean_upload.jlink.upload.use_1200bps_touch=false
holyiot_25008_nrf54l15.menu.clean_upload.jlink.upload.wait_for_upload_port=false
holyiot_25008_nrf54l15.menu.clean_upload.jlink.upload.pyocd_safe=false

holyiot_25008_nrf54l15.menu.clean_upload.nrf_ocd=nRF OCD (Native Fallback)
holyiot_25008_nrf54l15.menu.clean_upload.nrf_ocd.upload.tool=nrf54ocd
holyiot_25008_nrf54l15.menu.clean_upload.nrf_ocd.upload.tool.serial=nrf54ocd
holyiot_25008_nrf54l15.menu.clean_upload.nrf_ocd.upload.runner=nrf_ocd
holyiot_25008_nrf54l15.menu.clean_upload.nrf_ocd.upload.use_1200bps_touch=false
holyiot_25008_nrf54l15.menu.clean_upload.nrf_ocd.upload.wait_for_upload_port=false

holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm.upload.runner=pyocd
holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
holyiot_25008_nrf54l15.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

holyiot_25008_nrf54l15.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.tool=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.protocol=uf2
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.runner=uf2
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.use_1200bps_touch=false
holyiot_25008_nrf54l15.menu.clean_upload.uf2.upload.wait_for_upload_port=false

generic_nrf54l15_module_36pin.name=Generic nRF54L15 Module (36-pad)

generic_nrf54l15_module_36pin.upload.tool=nrf54ocd
generic_nrf54l15_module_36pin.upload.tool.serial=nrf54ocd
generic_nrf54l15_module_36pin.upload.protocol=cmsis-dap
generic_nrf54l15_module_36pin.upload.maximum_size=1548288
generic_nrf54l15_module_36pin.upload.maximum_data_size=155648
generic_nrf54l15_module_36pin.upload.wait_for_upload_port=false
generic_nrf54l15_module_36pin.upload.use_1200bps_touch=false
generic_nrf54l15_module_36pin.upload.disable_flushing=true
generic_nrf54l15_module_36pin.upload.runner=nrf_ocd
generic_nrf54l15_module_36pin.upload.target=nrf54l
generic_nrf54l15_module_36pin.upload.uid=
generic_nrf54l15_module_36pin.upload.pyocd_safe=auto
generic_nrf54l15_module_36pin.upload.probe_type=cmsisdap
generic_nrf54l15_module_36pin.upload.uf2_drive=auto
generic_nrf54l15_module_36pin.upload.uf2_labels=UF2BOOT,XIAO-NRF54L15,XIAO-NRF54,XIAO-NRF54LM20A,XIAO-NRF54LM20B,NRF54LM20A,NRF54LM20B,XIAO-SENSE,NRF54L15,NRF54BOOT,DAPLINK
generic_nrf54l15_module_36pin.upload.uf2_timeout=12
generic_nrf54l15_module_36pin.upload.openocd_script={runtime.platform.path}/tools/openocd/nrf54l15.cfg
generic_nrf54l15_module_36pin.upload.openocd_speed=4000
generic_nrf54l15_module_36pin.upload.openocd_bin={runtime.tools.openocd-0.11.0-arduino2.path}/bin/openocd

generic_nrf54l15_module_36pin.serial.disableDTR=false
generic_nrf54l15_module_36pin.serial.disableRTS=false

generic_nrf54l15_module_36pin.build.mcu=cortex-m33
generic_nrf54l15_module_36pin.build.f_cpu=64000000L
generic_nrf54l15_module_36pin.build.board=GENERIC_NRF54L15_MODULE_36PIN
generic_nrf54l15_module_36pin.build.core=nrf54l15
generic_nrf54l15_module_36pin.build.variant=nrf54l15_module_36pin
generic_nrf54l15_module_36pin.build.ldscript=nrf54l15_linker_script.ld
generic_nrf54l15_module_36pin.build.uf2_family=0xADA54B15
generic_nrf54l15_module_36pin.build.uf2_base_address=0x00000000
generic_nrf54l15_module_36pin.build.cpu_flags=-DARDUINO_NRF54_CPU_64M
generic_nrf54l15_module_36pin.build.power_flags=-DNRF54L15_CLEAN_POWER_LOW
generic_nrf54l15_module_36pin.build.boot_flags=
generic_nrf54l15_module_36pin.build.auto_gate_flags=
generic_nrf54l15_module_36pin.build.security_flags=
generic_nrf54l15_module_36pin.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1
generic_nrf54l15_module_36pin.build.ble_tx_flags=
generic_nrf54l15_module_36pin.build.ble_timing_flags=
generic_nrf54l15_module_36pin.build.ble_trace_flags=
generic_nrf54l15_module_36pin.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=1
generic_nrf54l15_module_36pin.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=0 -DNRF54L15_CLEAN_ZIGBEE_DISABLED
generic_nrf54l15_module_36pin.build.zigbee_channel_flags=
generic_nrf54l15_module_36pin.build.zigbee_pan_flags=
generic_nrf54l15_module_36pin.build.antenna_flags=
generic_nrf54l15_module_36pin.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER

generic_nrf54l15_module_36pin.menu.cpu_freq.64m=64 MHz (Default)
generic_nrf54l15_module_36pin.menu.cpu_freq.64m.build.f_cpu=64000000L
generic_nrf54l15_module_36pin.menu.cpu_freq.64m.build.cpu_flags=-DARDUINO_NRF54_CPU_64M
generic_nrf54l15_module_36pin.menu.cpu_freq.128m=128 MHz
generic_nrf54l15_module_36pin.menu.cpu_freq.128m.build.f_cpu=128000000L
generic_nrf54l15_module_36pin.menu.cpu_freq.128m.build.cpu_flags=-DARDUINO_NRF54_CPU_128M

generic_nrf54l15_module_36pin.build.extra_flags=-DARDUINO_NRF54L15 -DNRF54L15_XXAA {build.cpu_flags} {build.power_flags} {build.boot_flags} {build.auto_gate_flags} {build.security_flags} {build.ble_flags} {build.ble_tx_flags} {build.ble_timing_flags} {build.ble_trace_flags} {build.vpr_flags} {build.zigbee_flags} {build.zigbee_channel_flags} {build.zigbee_pan_flags} {build.thread_flags} {build.thread_seam_flags} {build.thread_crypto_flags} {build.matter_flags} {build.matter_seam_flags} {build.antenna_flags} {build.serial_flags}

