lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
generic_nrf54l15_module_36pin.menu.clean_ble.on=Enabled (Default)
generic_nrf54l15_module_36pin.menu.clean_ble.on.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1

generic_nrf54l15_module_36pin.menu.clean_ble.off=Disabled
generic_nrf54l15_module_36pin.menu.clean_ble.off.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=0 -DNRF54L15_CLEAN_BLE_DISABLED

generic_nrf54l15_module_36pin.menu.clean_ble_trace.off=Disabled (Default)
generic_nrf54l15_module_36pin.menu.clean_ble_trace.off.build.ble_trace_flags=

generic_nrf54l15_module_36pin.menu.clean_ble_trace.on=Enabled
generic_nrf54l15_module_36pin.menu.clean_ble_trace.on.build.ble_trace_flags=-DNRF54L15_CLEAN_BLE_TRACE=1

generic_nrf54l15_module_36pin.menu.clean_vpr.on=Enabled (Default)
generic_nrf54l15_module_36pin.menu.clean_vpr.on.build.ldscript=nrf54l15_linker_script.ld
generic_nrf54l15_module_36pin.menu.clean_vpr.on.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=1
generic_nrf54l15_module_36pin.menu.clean_vpr.on.upload.maximum_data_size=155648

generic_nrf54l15_module_36pin.menu.clean_vpr.off=Disabled (Reclaim RAM for Non-VPR Sketches)
generic_nrf54l15_module_36pin.menu.clean_vpr.off.build.ldscript=nrf54l15_linker_script_no_vpr.ld
generic_nrf54l15_module_36pin.menu.clean_vpr.off.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=0 -DNRF54L15_CLEAN_VPR_DISABLED
generic_nrf54l15_module_36pin.menu.clean_vpr.off.upload.maximum_data_size=261632

generic_nrf54l15_module_36pin.menu.clean_zigbee.off=Disabled (Default)
generic_nrf54l15_module_36pin.menu.clean_zigbee.off.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=0 -DNRF54L15_CLEAN_ZIGBEE_DISABLED

generic_nrf54l15_module_36pin.menu.clean_zigbee.on=Enabled (Experimental)
generic_nrf54l15_module_36pin.menu.clean_zigbee.on.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=1

generic_nrf54l15_module_36pin.menu.clean_thread.off=Disabled (Default)
generic_nrf54l15_module_36pin.menu.clean_thread.off.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=0 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
generic_nrf54l15_module_36pin.menu.clean_thread.off.build.thread_seam_flags=
generic_nrf54l15_module_36pin.menu.clean_thread.off.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

generic_nrf54l15_module_36pin.menu.clean_thread.stage=Experimental Stage Core (Leader/Child/Router + UDP)
generic_nrf54l15_module_36pin.menu.clean_thread.stage.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=1 -DNRF54L15_CLEAN_OPENTHREAD_MESHCOP_ENABLE=1 -DNRF54L15_CLEAN_OPENTHREAD_SRP_CLIENT_ENABLE=1 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
generic_nrf54l15_module_36pin.menu.clean_thread.stage.build.thread_seam_flags=-DOPENTHREAD_CONFIG_CORE_USER_CONFIG_HEADER_ENABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/third_party/mbedtls/repo/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/third_party/mbedtls/repo/library -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/third_party/mbedtls
generic_nrf54l15_module_36pin.menu.clean_thread.stage.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

generic_nrf54l15_module_36pin.menu.clean_matter.off=Disabled (Default)
generic_nrf54l15_module_36pin.menu.clean_matter.off.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=0 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
generic_nrf54l15_module_36pin.menu.clean_matter.off.build.matter_seam_flags=

generic_nrf54l15_module_36pin.menu.clean_matter.stage=Experimental Compile Target (On-Network On/Off Light)
generic_nrf54l15_module_36pin.menu.clean_matter.stage.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=1 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
generic_nrf54l15_module_36pin.menu.clean_matter.stage.build.matter_seam_flags=-DNRF54L15_CLEAN_MATTER_HEADER_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_SUPPORT_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_ERROR_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_KEY_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_TIME_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_HEX_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_THREAD_DATASET_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_DATA_MODEL_SEED_AVAILABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/matter_core_stage -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/config/arduino -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/lib/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/lib/support -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/system -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/inet -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/crypto -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/protocols -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/transport -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src/messaging -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/platform/arduino

