lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
generic_nrf54l15_module_36pin.menu.clean_upload.auto=nRF OCD Native (Default)
generic_nrf54l15_module_36pin.menu.clean_upload.auto.upload.tool=nrf54ocd
generic_nrf54l15_module_36pin.menu.clean_upload.auto.upload.tool.serial=nrf54ocd
generic_nrf54l15_module_36pin.menu.clean_upload.auto.upload.runner=nrf_ocd
generic_nrf54l15_module_36pin.menu.clean_upload.auto.upload.use_1200bps_touch=false
generic_nrf54l15_module_36pin.menu.clean_upload.auto.upload.wait_for_upload_port=false

generic_nrf54l15_module_36pin.menu.clean_upload.pyocd=pyOCD Recovery (CMSIS-DAP)
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.tool=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.runner=pyocd
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.use_1200bps_touch=false

generic_nrf54l15_module_36pin.menu.clean_upload.jlink=J-Link via pyOCD (Experimental)
generic_nrf54l15_module_36pin.menu.clean_upload.jlink.upload.tool=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.jlink.upload.tool.default=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.jlink.upload.tool.serial=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.jlink.upload.runner=pyocd
generic_nrf54l15_module_36pin.menu.clean_upload.jlink.upload.protocol=default
generic_nrf54l15_module_36pin.menu.clean_upload.jlink.upload.probe_type=jlink
generic_nrf54l15_module_36pin.menu.clean_upload.jlink.upload.use_1200bps_touch=false
generic_nrf54l15_module_36pin.menu.clean_upload.jlink.upload.wait_for_upload_port=false
generic_nrf54l15_module_36pin.menu.clean_upload.jlink.upload.pyocd_safe=false

generic_nrf54l15_module_36pin.menu.clean_upload.nrf_ocd=nRF OCD (Native Fallback)
generic_nrf54l15_module_36pin.menu.clean_upload.nrf_ocd.upload.tool=nrf54ocd
generic_nrf54l15_module_36pin.menu.clean_upload.nrf_ocd.upload.tool.serial=nrf54ocd
generic_nrf54l15_module_36pin.menu.clean_upload.nrf_ocd.upload.runner=nrf_ocd
generic_nrf54l15_module_36pin.menu.clean_upload.nrf_ocd.upload.use_1200bps_touch=false
generic_nrf54l15_module_36pin.menu.clean_upload.nrf_ocd.upload.wait_for_upload_port=false

generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.runner=pyocd
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

generic_nrf54l15_module_36pin.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.tool=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.protocol=uf2
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.runner=uf2
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.use_1200bps_touch=false
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.wait_for_upload_port=false

nrf54l15dk_pca10156.name=Nordic PCA10156 nRF54L15 DK

nrf54l15dk_pca10156.upload.tool=nrf54ocd
nrf54l15dk_pca10156.upload.tool.serial=nrf54ocd
nrf54l15dk_pca10156.upload.protocol=cmsis-dap
nrf54l15dk_pca10156.upload.maximum_size=1548288
nrf54l15dk_pca10156.upload.maximum_data_size=155648
nrf54l15dk_pca10156.upload.wait_for_upload_port=false
nrf54l15dk_pca10156.upload.use_1200bps_touch=false
nrf54l15dk_pca10156.upload.disable_flushing=true
nrf54l15dk_pca10156.upload.runner=nrf_ocd
nrf54l15dk_pca10156.upload.target=nrf54l
nrf54l15dk_pca10156.upload.uid=
nrf54l15dk_pca10156.upload.pyocd_safe=auto
nrf54l15dk_pca10156.upload.probe_type=cmsisdap
nrf54l15dk_pca10156.upload.uf2_drive=auto
nrf54l15dk_pca10156.upload.uf2_labels=UF2BOOT,XIAO-NRF54L15,XIAO-NRF54,XIAO-NRF54LM20A,XIAO-NRF54LM20B,NRF54LM20A,NRF54LM20B,XIAO-SENSE,NRF54L15,NRF54BOOT,DAPLINK
nrf54l15dk_pca10156.upload.uf2_timeout=12
nrf54l15dk_pca10156.upload.openocd_script={runtime.platform.path}/tools/openocd/nrf54l15.cfg
nrf54l15dk_pca10156.upload.openocd_speed=4000
nrf54l15dk_pca10156.upload.openocd_bin={runtime.tools.openocd-0.11.0-arduino2.path}/bin/openocd

nrf54l15dk_pca10156.serial.disableDTR=false
nrf54l15dk_pca10156.serial.disableRTS=false

nrf54l15dk_pca10156.build.mcu=cortex-m33
nrf54l15dk_pca10156.build.f_cpu=64000000L
nrf54l15dk_pca10156.build.board=NRF54L15DK_PCA10156
nrf54l15dk_pca10156.build.core=nrf54l15
nrf54l15dk_pca10156.build.variant=nrf54l15dk_pca10156
nrf54l15dk_pca10156.build.ldscript=nrf54l15_linker_script.ld
nrf54l15dk_pca10156.build.uf2_family=0xADA54B15
nrf54l15dk_pca10156.build.uf2_base_address=0x00000000
nrf54l15dk_pca10156.build.cpu_flags=-DARDUINO_NRF54_CPU_64M
nrf54l15dk_pca10156.build.power_flags=-DNRF54L15_CLEAN_POWER_LOW
nrf54l15dk_pca10156.build.boot_flags=
nrf54l15dk_pca10156.build.auto_gate_flags=
nrf54l15dk_pca10156.build.security_flags=
nrf54l15dk_pca10156.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1
nrf54l15dk_pca10156.build.ble_tx_flags=
nrf54l15dk_pca10156.build.ble_timing_flags=
nrf54l15dk_pca10156.build.ble_trace_flags=
nrf54l15dk_pca10156.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=1
nrf54l15dk_pca10156.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=0 -DNRF54L15_CLEAN_ZIGBEE_DISABLED
nrf54l15dk_pca10156.build.zigbee_channel_flags=
nrf54l15dk_pca10156.build.zigbee_pan_flags=
nrf54l15dk_pca10156.build.antenna_flags=
nrf54l15dk_pca10156.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER
nrf54l15dk_pca10156.build.extra_flags=-DARDUINO_NRF54L15 -DNRF54L15_XXAA {build.cpu_flags} {build.power_flags} {build.boot_flags} {build.auto_gate_flags} {build.security_flags} {build.ble_flags} {build.ble_tx_flags} {build.ble_timing_flags} {build.ble_trace_flags} {build.vpr_flags} {build.zigbee_flags} {build.zigbee_channel_flags} {build.zigbee_pan_flags} {build.thread_flags} {build.thread_seam_flags} {build.thread_crypto_flags} {build.matter_flags} {build.matter_seam_flags} {build.antenna_flags} {build.serial_flags}

