lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
nrf54l15dk_pca10156.menu.clean_upload.auto=nRF OCD Native (Default)
nrf54l15dk_pca10156.menu.clean_upload.auto.upload.tool=nrf54ocd
nrf54l15dk_pca10156.menu.clean_upload.auto.upload.tool.serial=nrf54ocd
nrf54l15dk_pca10156.menu.clean_upload.auto.upload.runner=nrf_ocd
nrf54l15dk_pca10156.menu.clean_upload.auto.upload.use_1200bps_touch=false
nrf54l15dk_pca10156.menu.clean_upload.auto.upload.wait_for_upload_port=false

nrf54l15dk_pca10156.menu.clean_upload.pyocd=pyOCD Recovery (CMSIS-DAP)
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.tool=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.runner=pyocd
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.use_1200bps_touch=false

nrf54l15dk_pca10156.menu.clean_upload.jlink=J-Link via pyOCD (Experimental)
nrf54l15dk_pca10156.menu.clean_upload.jlink.upload.tool=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.jlink.upload.tool.default=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.jlink.upload.tool.serial=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.jlink.upload.runner=pyocd
nrf54l15dk_pca10156.menu.clean_upload.jlink.upload.protocol=default
nrf54l15dk_pca10156.menu.clean_upload.jlink.upload.probe_type=jlink
nrf54l15dk_pca10156.menu.clean_upload.jlink.upload.use_1200bps_touch=false
nrf54l15dk_pca10156.menu.clean_upload.jlink.upload.wait_for_upload_port=false
nrf54l15dk_pca10156.menu.clean_upload.jlink.upload.pyocd_safe=false

nrf54l15dk_pca10156.menu.clean_upload.nrf_ocd=nRF OCD (Native Fallback)
nrf54l15dk_pca10156.menu.clean_upload.nrf_ocd.upload.tool=nrf54ocd
nrf54l15dk_pca10156.menu.clean_upload.nrf_ocd.upload.tool.serial=nrf54ocd
nrf54l15dk_pca10156.menu.clean_upload.nrf_ocd.upload.runner=nrf_ocd
nrf54l15dk_pca10156.menu.clean_upload.nrf_ocd.upload.use_1200bps_touch=false
nrf54l15dk_pca10156.menu.clean_upload.nrf_ocd.upload.wait_for_upload_port=false

nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.runner=pyocd
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

nrf54l15dk_pca10156.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.tool=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.protocol=uf2
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.runner=uf2
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.use_1200bps_touch=false
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.wait_for_upload_port=false
